mathiasvr/silabs-8051-sdk/examples/EFM8SB2_SLSTK2011A/SMBus/Slave_Multibyte_HWACK/src/Interrupts.c
//=========================================================
// src/Interrupts.c: generated by Hardware Configurator
//
// This file will be regenerated when saving a document.
// leave the sections inside the "$[...]" comment tags alone
// or they will be overwritten!
//=========================================================

// USER INCLUDES
#include <SI_EFM8SB2_Register_Enums.h>
#include "EFM8SB2_SMBus_Slave_Multibyte_HWACK.h"

//-----------------------------------------------------------------------------
// TIMER0_ISR
//-----------------------------------------------------------------------------
//
// TIMER0 ISR Content goes here. Remember to clear flag bits:
// TCON::TF0 (Timer 0 Overflow Flag)
//
//-----------------------------------------------------------------------------
SI_INTERRUPT(TIMER0_ISR, TIMER0_IRQn)
{
  SMB0CN0_ACK = 0;
}

uint8_t first_entry = 1;               // Set to 1 to indicate that
// the start bit should be set
// on the next SMBus interrupt
//-----------------------------------------------------------------------------
// SMBUS0_ISR
//-----------------------------------------------------------------------------
//
// SMBUS0 ISR Content goes here. Remember to clear flag bits:
// SMB0CN::SI (SMBus Interrupt Flag)
//
//-----------------------------------------------------------------------------
SI_INTERRUPT(SMBUS0_ISR, SMBUS0_IRQn)
{
  static uint8_t sent_byte_counter;
  static uint8_t rec_byte_counter;

  if (EXTHOLD_ENABLE)
  {
    if (first_entry)
    {
      first_entry = 0;
      SMB0CN0_STA = 1;
      SMB0CF &= ~0x10;                  // Clear EXTHOLD to allow detection
      TCON_TR0 = 0;                          // of a repeated start
      TCON_TF0 = 0;                          // Stop Timer0 and clear flag

    }

  }

  if (SMB0CN0_ARBLOST == 0)
  {
    switch (SMB0CN0 & 0xF0)
    // Decode the SMBus status vector
    {
      // Slave Receiver: Start+Address received
      case SMB_SRADD:

        SMB0CN0_STA = 0;                   // Clear SMB0CN_STA bit

        if ((SMB0DAT & SMB0ADM & 0xFE) == (SMB0ADR & SMB0ADM & 0xFE))
        {
          sent_byte_counter = 1;     // Reinitialize the data counters
          rec_byte_counter = 1;      // Data counters are valid starting
          // with the second interrupt

          if ((SMB0DAT & 0x01) == READ) // If the transfer is a master READ,
          {
            // Prepare outgoing byte
            SMB0DAT = SMB_DATA_OUT[sent_byte_counter - 1];
            sent_byte_counter++;
          }
          else
          {
            SMB0CN0_ACK = 1;            // Auto-SMB0CN_ACK the next master WRITE
          }
        }
        else
        {
          SMB0CN0_SI = 0;
          return;
        }
        break;

        // Slave Receiver: Data received
      case SMB_SRDB:

        // If there are two or more bytes remaining to be received
        if (rec_byte_counter < NUM_BYTES_WR)
        {
          // Store incoming data
          SMB_DATA_IN[rec_byte_counter - 1] = SMB0DAT;
          rec_byte_counter++;

          SMB0CN0_ACK = 1;                // Auto-SMB0CN_ACK next data byte

        }
        // Otherwise, we are receiving the last byte
        else  // (rec_byte_counter == NUM_BYTES_WR)
        {
          // Store incoming data
          SMB_DATA_IN[rec_byte_counter - 1] = SMB0DAT;

          DATA_READY = 1;         // Indicate new data fully received
          SMB0CN0_ACK = 0;                // Auto-NACK next data byte
        }

        break;

        // Slave Receiver: Stop received while either a Slave Receiver or
        // Slave Transmitter
      case SMB_SRSTO:

        SMB0CN0_STO = 0;          // SMB0CN_STO must be cleared by software when
        // a STOP is detected as a slave

        if (EXTHOLD_ENABLE)
        {
          first_entry = 1;
          SMB0CF |= 0x10;            // Enable EXTHOLD to prevent being
          // interrupted on an unmatching slave
          // address
          TCON_TR0 = 1;                   // Start Timer
        }

        break;

        // Slave Transmitter: Data byte transmitted
      case SMB_STDB:

        if (SMB0CN0_ACK == 1)      // If Master SMB0CN_ACK's, send the next byte
        {
          if (sent_byte_counter <= NUM_BYTES_RD)
          {
            // Prepare next outgoing byte
            SMB0DAT = SMB_DATA_OUT[sent_byte_counter - 1];
            sent_byte_counter++;
          }
        }                          // Otherwise, do nothing
        break;

        // Slave Transmitter: Arbitration lost, Stop detected
        //
        // This state will only be entered on a bus error condition.
        // In normal operation, the slave is no longer sending data or has
        // data pending when a STOP is received from the master, so the SMB0CN_TXMODE
        // bit is cleared and the slave goes to the SRSTO state.
      case SMB_STSTO:

        SMB0CN0_STO = 0;          // SMB0CN_STO must be cleared by software when
        // a STOP is detected as a slave

        if (EXTHOLD_ENABLE)
        {
          first_entry = 1;           // Mark next entry as a new transfer
          SMB0CF |= 0x10;            // Enable EXTHOLD to prevent being
          // interrupted on an unmatching slave
          // address
          TCON_TR0 = 1;                   // Start Timer
        }

        break;

        // Default: all other cases undefined
      default:

        SMB0CF &= ~0x80;           // Reset communication
        SMB0CF |= 0x80;
        SMB0CN0_STA = 0;
        SMB0CN0_STO = 0;
        SMB0CN0_ACK = 0;

        if (EXTHOLD_ENABLE)
        {
          first_entry = 1;
          SMB0CF |= 0x10;            // Enable EXTHOLD to prevent being
          // interrupted on an unmatching slave
          // address
          TCON_TR0 = 1;                   // Start Timer
        }

        break;
    }
  }
  // SMB0CN_ARBLOST = 1, Abort failed transfer
  else
  {
    SMB0CN0_STA = 0;
    SMB0CN0_STO = 0;
    SMB0CN0_ACK = 0;

    if (EXTHOLD_ENABLE)
    {
      first_entry = 1;           // Mark next entry as a new transfer
      SMB0CF |= 0x10;            // Enable EXTHOLD to prevent being
      // interrupted on an unmatching slave
      // address
      TCON_TR0 = 1;                   // Start Timer
    }
  }

  SMB0CN0_SI = 0;                             // Clear SMBus interrupt flag
}

//-----------------------------------------------------------------------------
// TIMER3_ISR
//-----------------------------------------------------------------------------
//
// TIMER3 ISR Content goes here. Remember to clear flag bits:
// TMR3CN::TF3H (Timer # High Byte Overflow Flag)
// TMR3CN::TF3L (Timer # Low Byte Overflow Flag)
//
//-----------------------------------------------------------------------------
SI_INTERRUPT(TIMER3_ISR, TIMER3_IRQn)
{
  SMB0CF &= ~0x80;                    // Disable SMBus
  SMB0CF |= 0x80;                     // Re-enable SMBus
  TMR3CN0 &= ~0x80;                    // Clear Timer3 interrupt-pending flag

  if (EXTHOLD_ENABLE)
  {
    first_entry = 1;                 // Mark next entry as a new transfer
    SMB0CF |= 0x10;                  // Enable EXTHOLD to prevent being
    // interrupted on an unmatching slave
    // address
    TCON_TR0 = 1;                         // Start Timer
  }
}

